# Ecomerce Project- Dataframe Design

## Import an Clean the CSV

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns


table = pd.read_csv(r"C:\Users\cumdi\Desktop\Bootcamp Visual Studio\Modul 2\Sprint1\DATA\Sample-Superstore.csv", sep =",", encoding="cp1252")
table.head(1)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,11/8/2016,11/11/2016,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136

## Add a numerical Column for Location

In [2]:
# Alle relevanten Spalten als Strings behandeln und kombinieren
table["AddressCombi"] = (
    table["City"].astype(str) + " " +
    table["State"].astype(str) + " " +
    table["Region"].astype(str) + " " +
    table["Country"].astype(str) + " " +
    table["Postal Code"].astype(str)
)

# Eindeutige Adresse-ID generieren
table["AddressID"] = table["AddressCombi"].factorize()[0] + 1

# Hilfsspalte entfernen
table.drop(labels="AddressCombi", axis=1, inplace=True)

In [3]:
table.head(1)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,AddressID
0,1,CA-2016-152156,11/8/2016,11/11/2016,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136,1

## Umbennenen und Datacleaning

In [4]:
table = table.apply(lambda x: x.str.strip() if x.dtype == "object" else x)

In [5]:
table = table.apply(lambda x: x.str.lower() if x.dtype == "object" else x)

In [6]:
table.columns = table.columns.str.lower().str.replace(' ', '_')

In [7]:
table = table.rename(columns={'sub-category': 'sub_category'})

In [8]:
table.tail(1)

,row_id,order_id,order_date,ship_date,ship_mode,customer_id,customer_name,segment,country,city,...,region,product_id,category,sub_category,product_name,sales,quantity,discount,profit,addressid
9993,9994,ca-2017-119914,5/4/2017,5/9/2017,second class,cc-12220,chris cortes,consumer,united states,westminster,...,west,off-ap-10002684,office supplies,appliances,"acco 7-outlet masterpiece power center, wihtou...",243.16,2,0.0,72.948,280

In [9]:
table.head(2)

,row_id,order_id,order_date,ship_date,ship_mode,customer_id,customer_name,segment,country,city,...,region,product_id,category,sub_category,product_name,sales,quantity,discount,profit,addressid
0,1,ca-2016-152156,11/8/2016,11/11/2016,second class,cg-12520,claire gute,consumer,united states,henderson,...,south,fur-bo-10001798,furniture,bookcases,bush somerset collection bookcase,261.96,2,0.0,41.9136,1
1,2,ca-2016-152156,11/8/2016,11/11/2016,second class,cg-12520,claire gute,consumer,united states,henderson,...,south,fur-ch-10000454,furniture,chairs,"hon deluxe fabric upholstered stacking chairs,...",731.94,3,0.0,219.5820,1

In [10]:
#duplicates = table[table.duplicated(subset=["customer_name"])]
#print(duplicates)

In [11]:
#duplicates = table[table.duplicated(subset=["customer_name"])]
#print(duplicates)

In [12]:
# Anzahl der doppelten Zeilen (nach allen Spalten)
num_duplicates = table.duplicated().sum()
print(f"Anzahl der Duplikate: {num_duplicates}")

# Anzahl der doppelten Zeilen (nur nach bestimmten Spalten)
num_duplicates = table.duplicated(subset=["customer_name"]).sum()
print(f"Anzahl der Duplikate nach bestimmten Spalten: {num_duplicates}")

Anzahl der Duplikate: 0
Anzahl der Duplikate nach bestimmten Spalten: 9201

In [13]:
column_names = list(table.columns)
print(column_names)

['row_id', 'order_id', 'order_date', 'ship_date', 'ship_mode', 'customer_id', 'customer_name', 'segment', 'country', 'city', 'state', 'postal_code', 'region', 'product_id', 'category', 'sub_category', 'product_name', 'sales', 'quantity', 'discount', 'profit', 'addressid']

In [14]:
#table.describe()

In [15]:
table.head(1)

,row_id,order_id,order_date,ship_date,ship_mode,customer_id,customer_name,segment,country,city,...,region,product_id,category,sub_category,product_name,sales,quantity,discount,profit,addressid
0,1,ca-2016-152156,11/8/2016,11/11/2016,second class,cg-12520,claire gute,consumer,united states,henderson,...,south,fur-bo-10001798,furniture,bookcases,bush somerset collection bookcase,261.96,2,0.0,41.9136,1

In [16]:
table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 22 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   row_id         9994 non-null   int64
 1   order_id       9994 non-null   object
 2   order_date     9994 non-null   object
 3   ship_date      9994 non-null   object
 4   ship_mode      9994 non-null   object
 5   customer_id    9994 non-null   object
 6   customer_name  9994 non-null   object
 7   segment        9994 non-null   object
 8   country        9994 non-null   object
 9   city           9994 non-null   object
 10  state          9994 non-null   object
 11  postal_code    9994 non-null   int64
 12  region         9994 non-null   object
 13  product_id     9994 non-null   object
 14  category       9994 non-null   object
 15  sub_category   9994 non-null   object
 16  product_name   9994 non-null   object
 17  sales          9994 non-null   float64
 18  quantity       9994 non-null   int64
 19  discount       9994 non-null   float64
 20  profit         9994 non-null   float64
 21  addressid      9994 non-null   int64
dtypes: float64(3), int64(4), object(15)
memory usage: 1.7+ MB

# Conection with SQL

In [17]:
import sqlite3

In [18]:
conn = sqlite3.connect("edata.db") #connected zur Datenbank ecommerce
cur = conn.cursor()

#https://colab.research.google.com/drive/1I2RtqUwKxVUFTIX5uoghW4TY1sbhUy7q#scrollTo=378797f2

Eine Location ID hinzufügen und sie dann f+r Location udn Transaction nutzen

# Creat Teables in SQL

### Create Customer Table

Country ID noch schiwerig

In [19]:
#location = table[['customer_id', 'city', 'country','state', 'country-id']].drop_duplicates()

### Create Location/Shipping Table

In [20]:



with sqlite3.connect("edata.db") as conn:
    cur = conn.cursor()
    cur.execute("""
        CREATE TABLE IF NOT EXISTS Location (
            addressid TEXT PRIMARY KEY,
            country TEXT,
            state TEXT,
            region TEXT,
            postal_code INTEGER,
            city TEXT
        );
    """)
    conn.commit()

In [21]:
location_df = table[['addressid', 'country', 'state','region', 'postal_code', 'city']].drop_duplicates()

In [22]:
location_df.to_csv('location.csv', index=False, encoding='utf-8')

In [23]:
location_df.head(2)

   addressid        country       state region  postal_code         city
0          1  united states    kentucky  south        42420    henderson
2          2  united states  california   west        90036  los angeles

In [25]:


with sqlite3.connect("edata.db") as conn:
    cur = conn.cursor()
    for _, row in location_df.iterrows():
        cur.execute("""
            INSERT OR IGNORE INTO Location (addressid, country, state, region, postal_code, city)
            VALUES (?, ?, ?, ?, ?, ?)
        """, (
            row['addressid'],
            row['country'],
            row['state'],
            row['region'],
            row['postal_code'],
            row['city']
        ))
    conn.commit()

In [ ]:
# Fehler: zu viele Argumente
#customers_df[['customer_firstname', 'customer_surname']] = customers_df['customer_name'].str.split(' ', 1, expand=True)

## Customer Table

In [26]:
customers_df = table[['customer_id', 'customer_name', 'segment']].drop_duplicates(subset='customer_id')

# Sicherstellen, dass customer_name, customer_firstname, customer_surname und segment als String gespeichert sind
customers_df['customer_name'] = customers_df['customer_name'].astype(str)
customers_df['segment'] = customers_df['segment'].astype(str)

In [27]:

# Verbindung zur Datenbank
conn = sqlite3.connect("edata.db") #connected zur Datenbank ecommerce
cur = conn.cursor()


create_customer_table = """
CREATE TABLE IF NOT EXISTS Customer (
    customer_id TEXT PRIMARY KEY,
    customer_name TEXT NOT NULL,
    segment TEXT
);
"""

cur.execute(create_customer_table)

In [28]:

for index, row in customers_df.iterrows():
    cur.execute("""
    INSERT OR IGNORE INTO Customer (customer_id, customer_name, segment)
    VALUES (?, ?, ?)
    """, (row['customer_id'], row['customer_name'], row['segment']))

# Änderungen speichern
conn.commit()

# fehler weil es die Daten schon gibt

In [29]:
conn.commit()
conn.close()

In [30]:
customers_df.to_csv('customer.csv', index=False, encoding='utf-8')

## Products Table

In [31]:
#products_df = table[['product_id', 'product_name', 'category', 'sub-category']].drop_duplicates()

In [32]:


# Verbindung zur Datenbank
conn = sqlite3.connect("edata.db") #connected zur Datenbank ecommerce
cur = conn.cursor()

create_products_table = """
CREATE TABLE IF NOT EXISTS Products (
    product_id TEXT PRIMARY KEY,
    product_name TEXT NOT NULL,
    category TEXT,
    sub_category TEXT
);
"""

cur.execute(create_products_table)

In [33]:
try:
    conn.commit()
    conn.close()
except:
    pass

In [34]:



# Verbindung zur bestehenden Datenbank
conn = sqlite3.connect("edata.db")
cur = conn.cursor()

# Nur eindeutige, nicht-leere Länder aus dem DataFrame holen
products_df = table[['product_id', 'product_name', 'category', 'sub_category']].drop_duplicates()

# In Country-Tabelle einfügen (nur wenn noch nicht vorhanden)
for index, row in products_df.iterrows():
  cur.execute("""
INSERT OR IGNORE INTO Products (product_id, product_name, category, sub_category)
VALUES (?, ?, ?, ?)
""", (row['product_id'], row['product_name'], row['category'], row['sub_category']))
# Änderungen speichern

In [35]:
conn.commit()
conn.close()

In [36]:
table.head(2)

,row_id,order_id,order_date,ship_date,ship_mode,customer_id,customer_name,segment,country,city,...,region,product_id,category,sub_category,product_name,sales,quantity,discount,profit,addressid
0,1,ca-2016-152156,11/8/2016,11/11/2016,second class,cg-12520,claire gute,consumer,united states,henderson,...,south,fur-bo-10001798,furniture,bookcases,bush somerset collection bookcase,261.96,2,0.0,41.9136,1
1,2,ca-2016-152156,11/8/2016,11/11/2016,second class,cg-12520,claire gute,consumer,united states,henderson,...,south,fur-ch-10000454,furniture,chairs,"hon deluxe fabric upholstered stacking chairs,...",731.94,3,0.0,219.5820,1

In [37]:
products_df = table[['product_id', 'product_name', 'category', 'sub_category']].drop_duplicates()

In [38]:
products_df .to_csv('products.csv', index=False, encoding='utf-8')

In [39]:

import time



# Nur eindeutige Produktzeilen holen
products_df = table[['product_id', 'product_name', 'category', 'sub_category']].drop_duplicates()

# Verbindung öffnen
conn = None
max_retries = 5
for attempt in range(max_retries):
    try:
        conn = sqlite3.connect("edata.db")
        cur = conn.cursor()

        # Tabelle sicherstellen (optional, falls du's brauchst)
        cur.execute("""
        CREATE TABLE IF NOT EXISTS Products (
            product_id TEXT PRIMARY KEY,
            product_name TEXT NOT NULL,
            category TEXT,
            sub_category TEXT
        );
        """)

        # Daten als Liste vorbereiten
        data = products_df.values.tolist()

        # Einfügen – verhindert Konflikte mit INSERT OR IGNORE
        cur.executemany("""
        INSERT OR IGNORE INTO Products (product_id, product_name, category, sub_category)
        VALUES (?, ?, ?, ?)
        """, data)

        # Speichern und Verbindung schließen
        conn.commit()
        conn.close()
        print("✅ Daten erfolgreich eingefügt.")
        break

    except sqlite3.OperationalError as e:
        if "database is locked" in str(e):
            print(f"⚠️ Datenbank gesperrt, versuche erneut ({attempt+1}/{max_retries})...")
            time.sleep(1)
        else:
            raise e
    finally:
        if conn:
            try:
                conn.close()
            except:
                pass

✅ Daten erfolgreich eingefügt.

In [40]:
with sqlite3.connect("edata.db") as conn:
    cur = conn.cursor()
    cur.execute("""
        CREATE TABLE IF NOT EXISTS Transactions (
            order_id TEXT PRIMARY KEY,
            order_date TEXT,
            ship_date TEXT,
            ship_mode TEXT,
            customer_id TEXT,
            addressid TEXT,    
            FOREIGN KEY (customer_id) REFERENCES Location(addressid)
        );
    """)
    conn.commit()

In [41]:
# Nur eindeutige Transaktionen holen
transactions_df = table[['order_id', 'order_date', 'ship_date', 'ship_mode', 'customer_id', 'addressid']].drop_duplicates()




# Beispiel für eine DataFrame mit Transaktionen
# Angenommen, transactions_df ist bereits vorhanden

# Datum in das passende Format umwandeln
transactions_df['order_date'] = pd.to_datetime(transactions_df['order_date'], format='%m/%d/%Y').dt.strftime('%Y-%m-%d')
transactions_df['ship_date'] = pd.to_datetime(transactions_df['ship_date'], format='%m/%d/%Y').dt.strftime('%Y-%m-%d')

# Nur eindeutige Transaktionen
transactions_df = transactions_df[['order_id', 'order_date', 'ship_date', 'ship_mode', 'customer_id','addressid']].drop_duplicates()

# Verbindung zur SQLite-Datenbank herstellen
with sqlite3.connect("edata.db") as conn:
    cur = conn.cursor()
    
    # Einfügen der Daten in die Tabelle
    for _, row in transactions_df.iterrows():
        cur.execute("""
            INSERT OR IGNORE INTO Transactions (order_id, order_date, ship_date, ship_mode, customer_id,addressid)
            VALUES (?, ?, ?, ?, ?, ?)
        """, (
            row['order_id'],
            row['order_date'],
            row['ship_date'],
            row['ship_mode'],
            row['customer_id'],
            row['addressid']
        ))
    conn.commit()

In [42]:
transactions_df.to_csv('transactions.csv', index=False, encoding='utf-8')

In [43]:
with sqlite3.connect("edata.db") as conn:
    cur = conn.cursor()

    # Überprüfen, ob die Tabelle 'Totalorders' existiert, andernfalls erstellen
    cur.execute("""
        CREATE TABLE IF NOT EXISTS Totalorders (
            order_id TEXT PRIMARY KEY,
            product_id TEXT,
            sales INTEGER,
            quantity INTEGER,
            discount INTEGER,
            profit INTEGER,
            FOREIGN KEY (product_id) REFERENCES Products(product_id)
        );
    """)

    # Um mehrere Zeilen gleichzeitig hinzuzufügen, verwenden wir executemany
    totalorders_df = table[['order_id', 'product_id', 'sales', 'quantity', 'discount', 'profit']].values.tolist()
    
    # Insert der Daten (mit IGNORE, um Duplikate zu vermeiden)
    cur.executemany("""
        INSERT OR IGNORE INTO Totalorders (order_id, product_id, sales, quantity, discount, profit)
        VALUES (?, ?, ?, ?, ?, ?)
    """, totalorders_df)
    
    # Änderungen speichern
    conn.commit()

In [ ]:
totalorders_df = table[['order_id', 'product_id', 'sales', 'quantity', 'discount', 'profit']].drop_duplicates()

In [ ]:
cols = ['sales', 'profit', 'discount']

#for col in cols:
    #df[col] = df[col].astype(str).str.strip().astype(float)


#df['quantity'] = df['quantity'].astype(str).str.strip()  # Leerzeichen entfernen


# CSV abspeichern (ohne Index)
#df.to_csv('totalorders_float.csv', index=False)

In [ ]:
totalorders_df[cols] = totalorders_df[cols].apply(lambda x: x.astype(str).str.strip().astype(float))

In [ ]:
totalorders_df['quantity'] = pd.to_numeric(totalorders_df['quantity'].astype(str).str.strip(), errors='coerce').astype('Int64')

In [45]:
totalorders_df.to_csv('totalorders.csv', index=False, encoding='utf-8')